shop = [['каретка', 1200], ['шатун', 1000], ['седлq', 300],
        ['педаль', 100], ['седлf', 1500], ['рама', 12000],
        ['обод', 2000], ['шатун', 200], ['седло', 2700]]
count = -1
inp = input("Название детали: ")

for i in shop:
        count += 1
        if shop[count][0] == inp:
                number = int(input("Кол-во деталей - "))
                print("Общая стоимость - ", shop[count][1] * number)
                break
        elif count == 8:
                print("Извините, такой детали нету!")

